luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxPort_regdef.h
/** \brief  Port Pin Controller Select Register */
typedef struct _Ifx_P_PCSR_Bits
{
    unsigned int SEL0:1;                    /**< \brief [0:0] Pin Controller Select for Pin 0 (rw) */
    unsigned int SEL1:1;                    /**< \brief [1:1] Pin Controller Select for Pin 1 (rw) */
    unsigned int SEL2:1;                    /**< \brief [2:2] Pin Controller Select for Pin 2 (rw) */
    unsigned int SEL3:1;                    /**< \brief [3:3] Pin Controller Select for Pin 3 (rw) */
    unsigned int SEL4:1;                    /**< \brief [4:4] Pin Controller Select for Pin 4 (rw) */
    unsigned int SEL5:1;                    /**< \brief [5:5] Pin Controller Select for Pin 5 (rw) */
    unsigned int SEL6:1;                    /**< \brief [6:6] Pin Controller Select for Pin 6 (rw) */
    unsigned int reserved_7:3;              /**< \brief \internal Reserved */
    unsigned int SEL10:1;                   /**< \brief [10:10] Pin Controller Select for Pin 10 (rw) */
    unsigned int SEL11:1;                   /**< \brief [11:11] Pin Controller Select for Pin 11 (rw) */
    unsigned int reserved_12:19;            /**< \brief \internal Reserved */
    unsigned int LCK:1;                     /**< \brief [31:31] Lock Status (rh) */
} Ifx_P_PCSR_Bits;

/** \brief  Port Pin Function Decision Control Register */
typedef struct _Ifx_P_PDISC_Bits
{
    unsigned int PDIS0:1;                   /**< \brief [0:0] Pin Function Decision Control for Pin 0 (rw) */
    unsigned int PDIS1:1;                   /**< \brief [1:1] Pin Function Decision Control for Pin 1 (rw) */
    unsigned int PDIS2:1;                   /**< \brief [2:2] Pin Function Decision Control for Pin 2 (rw) */
    unsigned int PDIS3:1;                   /**< \brief [3:3] Pin Function Decision Control for Pin 3 (rw) */
    unsigned int PDIS4:1;                   /**< \brief [4:4] Pin Function Decision Control for Pin 4 (rw) */
    unsigned int PDIS5:1;                   /**< \brief [5:5] Pin Function Decision Control for Pin 5 (rw) */
    unsigned int PDIS6:1;                   /**< \brief [6:6] Pin Function Decision Control for Pin 6 (rw) */
    unsigned int PDIS7:1;                   /**< \brief [7:7] Pin Function Decision Control for Pin 7 (rw) */
    unsigned int PDIS8:1;                   /**< \brief [8:8] Pin Function Decision Control for Pin 8 (rw) */
    unsigned int PDIS9:1;                   /**< \brief [9:9] Pin Function Decision Control for Pin 9 (rw) */
    unsigned int PDIS10:1;                  /**< \brief [10:10] Pin Function Decision Control for Pin 10 (rw) */
    unsigned int PDIS11:1;                  /**< \brief [11:11] Pin Function Decision Control for Pin 11 (rw) */
    unsigned int PDIS12:1;                  /**< \brief [12:12] Pin Function Decision Control for Pin 12 (rw) */
    unsigned int PDIS13:1;                  /**< \brief [13:13] Pin Function Decision Control for Pin 13 (rw) */
    unsigned int PDIS14:1;                  /**< \brief [14:14] Pin Function Decision Control for Pin 14 (rw) */
    unsigned int PDIS15:1;                  /**< \brief [15:15] Pin Function Decision Control for Pin 15 (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_P_PDISC_Bits;

/** \brief  Port Pad Driver Mode 0 Register */
typedef struct _Ifx_P_PDR0_Bits
{
    unsigned int PD0:3;                     /**< \brief [2:0]  (rw) */
    unsigned int PL0:1;                     /**< \brief [3:3]  (rw) */
    unsigned int PD1:3;                     /**< \brief [6:4]  (rw) */
    unsigned int PL1:1;                     /**< \brief [7:7]  (rw) */
    unsigned int PD2:3;                     /**< \brief [10:8]  (rw) */
    unsigned int PL2:1;                     /**< \brief [11:11]  (rw) */
    unsigned int PD3:3;                     /**< \brief [14:12]  (rw) */
    unsigned int PL3:1;                     /**< \brief [15:15]  (rw) */
    unsigned int PD4:3;                     /**< \brief [18:16]  (rw) */
    unsigned int PL4:1;                     /**< \brief [19:19]  (rw) */
    unsigned int PD5:3;                     /**< \brief [22:20]  (rw) */
    unsigned int PL5:1;                     /**< \brief [23:23]  (rw) */
    unsigned int PD6:3;                     /**< \brief [26:24]  (rw) */
    unsigned int PL6:1;                     /**< \brief [27:27]  (rw) */
    unsigned int PD7:3;                     /**< \brief [30:28]  (rw) */
    unsigned int PL7:1;                     /**< \brief [31:31]  (rw) */
} Ifx_P_PDR0_Bits;

/** \brief  Port Pad Driver Mode 1 Register */
typedef struct _Ifx_P_PDR1_Bits
{
    unsigned int PD8:3;                     /**< \brief [2:0]  (rw) */
    unsigned int PL8:1;                     /**< \brief [3:3]  (rw) */
    unsigned int PD9:3;                     /**< \brief [6:4]  (rw) */
    unsigned int PL9:1;                     /**< \brief [7:7]  (rw) */
    unsigned int PD10:3;                    /**< \brief [10:8]  (rw) */
    unsigned int PL10:1;                    /**< \brief [11:11]  (rw) */
    unsigned int PD11:3;                    /**< \brief [14:12]  (rw) */
    unsigned int PL11:1;                    /**< \brief [15:15]  (rw) */
    unsigned int PD12:3;                    /**< \brief [18:16]  (rw) */
    unsigned int PL12:1;                    /**< \brief [19:19]  (rw) */
    unsigned int PD13:3;                    /**< \brief [22:20]  (rw) */
    unsigned int PL13:1;                    /**< \brief [23:23]  (rw) */
    unsigned int PD14:3;                    /**< \brief [26:24]  (rw) */
    unsigned int PL14:1;                    /**< \brief [27:27]  (rw) */
    unsigned int PD15:3;                    /**< \brief [30:28]  (rw) */
    unsigned int PL15:1;                    /**< \brief [31:31]  (rw) */
} Ifx_P_PDR1_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_union
 * \{  */

/** \brief  Port Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_ACCEN0_Bits B;                    /**< \brief Bitfield access */
} Ifx_P_ACCEN0;

/** \brief  Port Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_ACCEN1_Bits B;                    /**< \brief Bitfield access */
} Ifx_P_ACCEN1;

/** \brief  Port Emergency Stop Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_P_ESR_Bits B;                       /**< \brief Bitfield access */
} Ifx_P_ESR;

